Revit 2027 API
Document.NewAreaBoundaryLine Method
Creates a new boundary line as an Area border.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelCurve NewAreaBoundaryLine(
	SketchPlane sketchPlane,
	Curve geometryCurve,
	ViewPlan areaView
)
Public Function NewAreaBoundaryLine (
	sketchPlane As SketchPlane,
	geometryCurve As Curve,
	areaView As ViewPlan
) As ModelCurve
public:
ModelCurve^ NewAreaBoundaryLine(
	SketchPlane^ sketchPlane,
	Curve^ geometryCurve,
	ViewPlan^ areaView
)
member NewAreaBoundaryLine :
        sketchPlane : SketchPlane *
        geometryCurve : Curve *
        areaView : ViewPlan -> ModelCurve
Parameters
sketchPlane SketchPlane
The sketch plane.
geometryCurve Curve
The geometry curve on which the boundary line are
areaView ViewPlan
The View for the new Area
Return Value
ModelCurve
Exceptions
Exception | Condition
ArgumentException | Thrown if the sketch plane does not exist in the given document.
ArgumentException | Thrown if the area view does not exist in the given document.
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace